Лабораторная работа №1: Работа с структурами данных, циклами и условными операторами в Python


Цель работы: Освоить работу со структурами данных, циклами и условными операторами в языке программирования Python.

1. Работа со структурами данных

Для создания списка чисел от 1 до 10 следует использовать следующий код:

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

Для вывода на экран первого, третьего и последнего элементов списка можно использовать следующий код:

print(my_list[0])    # Вывод первого элемента
print(my_list[2])    # Вывод третьего элемента
print(my_list[-1])   # Вывод последнего элемента


Для замены второго элемента списка на значение 100 используйте следующий код:

my_list[1] = 100     # Замена второго элемента


2. Работа с циклами

Цикл for: Для вывода на экран всех чисел от 1 до 10 следует использовать цикл for:

for i in range(1, 11):
    print(i)

Цикл while: Для вывода на экран всех чисел от 10 до 1 с помощью цикла while используйте следующий код:

i = 10
while i >= 1:
    print(i)
    i -= 1

3. Работа с условными операторами

Условный оператор if: Для проверки четности введенного пользователем числа и вывода соответствующего сообщения используйте следующий код:

num = int(input("Введите число: "))
if num % 2 == 0:
    print("Число четное")
else:
    print("Число нечетное")


Условный оператор if-else: Для проверки положительного или отрицательного числа используйте следующий код:

num = int(input("Введите число: "))
if num > 0:
    print("Число положительное")
elif num < 0:
    print("Число отрицательное")
else:
    print("Число равно нулю")


4. Домашнее задание

Задача 1: 
Напишите программу, которая запрашивает у пользователя ввод числа и выводит на экран все числа от 1 до введенного числа включительно.
Пример:

Введите число: 5
1
2
3
4
5

	Задача 2:
	Напишите программу, которая запрашивает у пользователя ввод 2 чисел и выводит на экран большее из них.
Пример:
Введите первое число: 10
Введите второе число: 5
Большее число: 10





